<?php
/**
 * Created by PhpStorm.
 * User: User
 * Date: 15.08.2019
 * Time: 16:57
 */
class Functions
{

    public static function changeTitles($titles)
    {
        $searchArray = [
            'region' => [
                'субъект',
                'регион'
            ],
            'city' => [
                'населенный',
                'город',
                'территория',
                'населённый '
            ],
            'Мотоциклы и мотороллеры' => [
                'мотоциклы',
                'категория «а», «м»',
                'категория «a», «м»',
                'мопеды,'],
            'Легковые а/м, физики' => [
                'физических лиц',
                'физ. лиц',
            ],
            'Легковые а/м, юрики' => [
                'юр',
                'юридических лиц',
                'юр. лиц',
            ],
            'Легковые а/м' => [
                'легковые а/м, юрики',
                'легковые а/м, физики'
            ],
            'Легковые а/м, используемые в такси' => [
                'такси'
            ],
            'Грузовые а/м с разрешенной массой до 16 т вкл.' => [
                'менее 16 тонн',
                '16 тонн и менее'
            ],
            'Грузовые а/м с разрешенной массой свыше 16 т' => [
                'более 16 тонн'
            ],
            'Автобусы, используемые в такси' => [
                'маршрутка',
                'маршруту'
            ],
            'Автобусы с числом мест сидения до 20 вкл.' => [
                'мест до 16',
                'до 16 мест'
            ],
            'Автобусы с числом мест сидения свыше 20' => [
                'мест более 16',
                'более 16 мест'
            ],
            'Троллейбусы' => [
                'троллейбусы'
            ],
            'Трамваи' => [
                'трамваи'
            ],
            'Тракторы, дорожно-строительные и иные машины' => [
                'тракторы'
            ]
        ];
        foreach ($searchArray as $title => $searches){
            foreach ($searches as $search){
                if (mb_strpos(mb_strtolower($titles), $search) !== false){
                    return $title;
                }
            }
        }
    }

    public static function changeTitlesOutPut($titles)
    {
        $searchArray = [
            'Легковые а/м' => [
                'легковые а/м, юрики',
                'легковые а/м, физики'
            ]
        ];
        foreach ($searchArray as $title => $searches){
            foreach ($searches as $search){
                if (mb_strpos(mb_strtolower($titles), $search) !== false){
                    return $title;
                }
            }
        }
    }

    public static function arrayOsago(){
        $osagoRegion = array(
            'Санкт-Петербург' => array(
                'Санкт-Петербург' => '7800000000000'
            ),
            'Ленинградская область' => array(
                'Ленинградская область' => '4700000000000',
                'Сосновый Бор' => '4700000400000'
            ),
            'Москва' => array(
                'Москва' => '7700000000000'
            ),
            'Московская область' => array(
                'Московская область' => '5000000000000',
                'Балашиха' => '5000003600000'
            ),
            'Республика Крым' => array(
                'Республика Крым' => '9100000000000',
                'Симферополь' => '9100000700000',
                'Прочие города и населенные пункты' => '9101200000600'
            ),
            'Севастополь' => array(
                'Севастополь' => '9200000000000'
            ),
            'Байконур' => array(
                'Байконур' => '9900000000000',
                'Акай' => '9900000000100'
            ),
            'Алтайский край' => array(
                'Алтайский край' => '2200000000000',
                'Барнаул' => '2200000100000',
                'Бийск' => '2200000400000',
                'Заринск' => '2200001100000',
                'Новоалтайск' => '2200000800000',
                'Рубцовск' => '2200000900000',
                'Прочие города и населенные пункты' => '2200001000000'
            ),
            'Амурская область' => array(
                'Амурская область' => '2800000000000',
                'Благовещенск' => '2800000100000',
                'Белогорск' => '2800000300000',
                'Свободный' => '2800000500000',
                'Прочие города и населенные пункты' => '2800000400000'
            ),
            'Архангельская область' => array(
                'Архангельская область' => '2900000000000',
                'Северодвинск' => '2900000400000',
                'Архангельск' => '2900000100000',
                'Котлас' => '2900800100000',
                'Прочие города и населенные пункты' => '2900000200000',
            ),
            'Астраханская область' => array(
                'Астраханская область' => '3000000000000',
                'Астрахань' => '3000000100000',
                'Прочие города и населенные пункты' => '3000000200000'
            ),
            'Белгородская область' => array(
                'Белгородская область' => '3100000000000',
                'Губкин' => '3100000400000',
                'Старый Оскол' => '3100000200000',
                'Белгород' => '3100000100000',
                'Прочие города и населенные пункты' => '3100000300000'
            ),
            'Брянская область' => array(
                'Брянская область' => '3200000000000',
                'Клинцы' => '3200000300000',
                'Брянск' => '3200000100000',
                'Прочие города и населенные пункты' => '3200000400000'
            ),
            'Владимирская область' => array(
                'Владимирская область' => '3300000000000',
                'Муром' => '3300000500000',
                'Гусь-Хрустальный' => '3300000300000',
                'Владимир' => '3300000100000',
                'Прочие города и населенные пункты' => '3300000400000'
            ),
            'Волгоградская область' => array(
                'Волгоградская область' => '3400000000000',
                'Волжский' => '3400000200000',
                'Камышин' => '3400000300000',
                'Михайловка' => '3400000400000',
                'Волгоград' => '3400000100000',
                'Прочие города и населенные пункты' => '3400000500000'
            ),
            'Вологодская область' => array(
                'Вологодская область' => '3500000000000',
                'Вологда' => '3500000100000',
                'Череповец' => '3500000200000',
                'Прочие города и населенные пункты' => '3500100500300'
            ),
            'Воронежская область' => array(
                'Воронежская область' => '3600000000000',
                'Воронеж' => '3600000100000',
                'Борисоглебск' => '3600500100000',
                'Лиски' => '3601500100000',
                'Россошь' => '3602800100000',
                'Прочие города и населенные пункты' => '3600000300000'
            ),
            'Еврейская автономная область' => array(
                'Еврейская автономная область' => '7900000000000',
                'Биробиджан' => '7900000100000',
                'Прочие города и населенные пункты' => '7900200002500'
            ),
            'Забайкальский край' => array(
                'Забайкальский край' => '7500000000000',
                'Чита' => '7500000100000',
                'Краснокаменск' => '7501100100000',
                'Прочие города и населенные пункты' => '7500000200000'
            ),
            'Ивановская область' => array(
                'Ивановская область' => '3700000000000',
                'Кинешма' => '3700000200000',
                'Шуя' => '3701900100000',
                'Иваново' => '3700000100000',
                'Прочие города и населенные пункты' => '3701800001900'
            ),
            'Иркутская область' => array(
                'Иркутская область' => '3800000000000',
                'Иркутск' => '3800000300000',
                'Ангарск' => '3800000400000',
                'Усолье-Сибирское' => '3800001100000',
                'Братск' => '3800000500000',
                'Тулун' => '3800001000000',
                'Усть-Илимск' => '3800001200000',
                'Усть-Кут' => '3800001300000',
                'Черемхово' => '3800001400000',
                'Шелехов' => '3800001500000',
                'Прочие города и населенные пункты' => '3800000700000'
            ),
            'Кабардино-Балкарская Республика' => array(
                'Кабардино-Балкарская Республика' => '0700000000000',
                'Нальчик' => '0700000100000',
                'Прохладный' => '0700000200000',
                'Прочие города и населенные пункты' => '0700000300000'
            ),
            'Калининградская область' => array(
                'Калининградская область' => '3900000000000',
                'Калининград' => '3900000100000',
                'Прочие города и населенные пункты' => '3900000800000'
            ),
            'Калужская область' => array(
                'Калужская область' => '4000000000000',
                'Калуга' => '4000000100000',
                'Обнинск' => '4000000200000',
                'Прочие города и населенные пункты' => '4000200000200'
            ),
            'Камчатский край' => array(
                'Камчатский край' => '4100000000000',
                'Петропавловск-Камчатский' => '4100000100000',
                'Прочие города и населенные пункты' => '4100000200000'
            ),
            'Карачаево-Черкесская Республика' => array(
                'Карачаево-Черкесская Республика' => '0900000000000',
                'Карачаевск' => '0900000200000',
                'Черкесск' => '0900000100000'
            ),
            'Кемеровская область' => array(
                'Кемеровская область' => '4200000000000',
                'Анжеро-Судженск' => '4200000200000',
                'Киселевск' => '4200000500000',
                'Юрга' => '4200001400000',
                'Новокузнецк' => '4200001200000',
                'Белово' => '4200001500000',
                'Березовский (Кем. обл.)' => '4200000300000',
                'Осинники' => '4200000700000',
                'Прокопьевск' => '4200001300000',
                'Междуреченск' => '4200001600000',
                'Кемерово' => '4200000900000',
                'Прочие города и населенные пункты' => '4200000800000'
            ),
            'Кировская область' => array(
                'Кировская область' => '4300000000000',
                'Кирово-Чепецк' => '4300000400000',
                'Киров' => '4300000100000',
                'Прочие города и населенные пункты' => '4300000200000'
            ),
            'Костромская область' => array(
                'Костромская область' => '4400000000000',
                'Кострома' => '4400000300000',
                'Прочие города и населенные пункты' => '4400000200000'
            ),
            'Краснодарский край' => array(
                'Краснодарский край' => '2300000000000',
                'Армавир' => '2300000200000',
                'Сочи' => '2300000700000',
                'Туапсе' => '2303600100000',
                'Белореченск' => '2300600100000',
                'Ейск' => '2301100100000',
                'Кропоткин' => '2301200100000',
                'Крымск' => '2301800100000',
                'Курганинск' => '2301900100000',
                'Лабинск' => '2302100100000',
                'Славянск-на-Кубани' => '2303000100000',
                'Тимашевск' => '2303400100000',
                'Тихорецк' => '2303500100000',
                'Краснодар' => '2300000100000',
                'Новороссийск' => '2300000600000',
                'Анапа' => '2300300100000',
                'Геленджик' => '2300000300000',
                'Прочие города и населенные пункты' => '2300000400000'
            ),
            'Красноярский край' => array(
                'Красноярский край' => '2400000000000',
                'Ачинск' => '2400001200000',
                'Зеленогорск' => '2400000500000',
                'Канск' => '2400001600000',
                'Лесосибирск' => '2400000800000',
                'Минусинск' => '2400001700000',
                'Назарово' => '2400001800000',
                'Красноярск' => '2400000100000',
                'Железногорск (Красн.)' => '2400000400000',
                'Норильск' => '2400000900000',
                'Прочие города и населенные пункты' => '2400001900000'
            ),
            'Курганская область' => array(
                'Курганская область' => '4500000000000',
                'Шадринск' => '4500000200000',
                'Курган' => '4500000100000',
                'Прочие города и населенные пункты' => '4500200000200'
            ),
            'Курская область' => array(
                'Курская область' => '4600000000000',
                'Курск' => '4600000100000',
                'Железногорск' => '4600000300000',
                'Прочие города и населенные пункты' => '4600000400000'
            ),
            'Липецкая область' => array(
                'Липецкая область' => '4800000000000',
                'Елец' => '4800000200000',
                'Липецк' => '4800000100000',
                'Прочие города и населенные пункты' => '4800200000200'
            ),
            'Магаданская область' => array(
                'Магаданская область' => '4900000000000',
                'Магадан' => '4900000100000',
                'Прочие города и населенные пункты' => '4900500000300'
            ),
            'Мурманская область' => array(
                'Мурманская область' => '5100000000000',
                'Мурманск' => '5100000100000',
                'Апатиты' => '5100000200000',
                'Мончегорск' => '5100000600000',
                'Североморск' => '5100001100000',
                'Прочие города и населенные пункты' => '5100000700000'
            ),
            'Ненецкий автономный округ' => array(
                'Ненецкий автономный округ' => '8300000000000',
                'Нарьян-Мар' => '8300000100000'
            ),
            'Нижегородская область' => array(
                'Нижегородская область' => '5200000000000',
                'Кстово' => '5202700100000',
                'Арзамас' => '5200000400000',
                'Выкса' => '5200000700000',
                'Саров' => '5200000300000',
                'Нижний Новгород' => '5200000100000',
                'Балахна' => '5200400100000',
                'Бор' => '5200000500000',
                'Дзержинск' => '5200000200000',
                'Прочие города и населенные пункты' => '5200000800000'
            ),
            'Новгородская область' => array(
                'Новгородская область' => '5300000000000',
                'Боровичи' => '5300300100000',
                'Великий Новгород' => '5300000100000',
                'Прочие города и населенные пункты' => '5301900008300'
            ),
            'Новосибирская область' => array(
                'Новосибирская область' => '5400000000000',
                'Новосибирск' => '5400000100000',
                'Искитим' => '5400000500000',
                'Куйбышев' => '5400000600051',
                'Бердск' => '5400000200000',
                'Прочие города и населенные пункты' => '5400000300000'
            ),
            'Омская область' => array(
                'Омская область' => '5500000000000',
                'Омск' => '5500000100000',
                'Прочие города и населенные пункты' => '5500200000100'
            ),
            'Оренбургская область' => array(
                'Оренбургская область' => '5600000000000',
                'Оренбург' => '5600000100000',
                'Орск' => '5600000400000',
                'Бугуруслан' => '5600000500000',
                'Бузулук' => '5600000600000',
                'Новотроицк' => '5600000300000',
                'Прочие города и населенные пункты' => '5600000700000'
            ),
            'Орловская область' => array(
                'Орловская область' => '5700000000000',
                'Орел' => '5700000100000',
                'Ливны' => '5700000200000',
                'Мценск' => '5700000300000',
                'Прочие города и населенные пункты' => '5701800005700'
            ),
            'Пензенская область' => array(
                'Пензенская область' => '5800000000000',
                'Заречный' => '5800000200000',
                'Пенза' => '5800000100000',
                'Кузнецк' => '5800000300000',
                'Прочие города и населенные пункты' => '5802200002200'
            ),
            'Пермский край' => array(
                'Пермский край' => '5900000000000',
                'Соликамск' => '5900001100000',
                'Лысьва' => '5900001000000',
                'Чайковский' => '5900001200000',
                'Березники' => '5900000200000',
                'Краснокамск' => '5903500100051',
                'Пермь' => '5900000100000',
                'Прочие города и населенные пункты' => '5900000500000'
            ),
            'Приморский край' => array(
                'Приморский край' => '2500000000000',
                'Владивосток' => '2500000100000',
                'Арсеньев' => '2500000200000',
                'Артем' => '2500000300000',
                'Находка' => '2500000400000',
                'Спасск-Дальний' => '2500001000000',
                'Уссурийск' => '2500001100000',
                'Прочие города и населенные пункты' => '2500001200000'
            ),
            'Псковская область' => array(
                'Псковская область' => '6000000000000',
                'Псков' => '6000000100000',
                'Великие Луки' => '6000000200000',
                'Прочие города и населенные пункты' => '6000200059300'
            ),
            'Республика Адыгея' => array(
                'Республика Адыгея' => '0100000000000',
                'Майкоп' => '0100000100000'
            ),
            'Республика Алтай' => array(
                'Республика Алтай' => '0400000000000',
                'Горно-Алтайск' => '0400000100000',
                'Прочие города и населенные пункты' => '0400200100000'
            ),
            'Республика Башкортостан' => array(
                'Республика Башкортостан' => '0200000000000',
                'Благовещенск (Баш)' => '0201500100000',
                'Октябрьский' => '0200000400000',
                'Ишимбай' => '0202600100000',
                'Кумертау' => '0200000700000',
                'Салават' => '0200000500000',
                'Уфа' => '0200000100000',
                'Стерлитамак' => '0200001400000',
                'Туймазы' => '0204400100000',
                'Прочие города и населенные пункты' => '0200000200000'
            ),
            'Республика Бурятия' => array(
                'Республика Бурятия' => '0300000000000',
                'Улан-Удэ' => '0300000100000',
                'Прочие города и населенные пункты' => '0300000200000'
            ),
            'Республика Дагестан' => array(
                'Республика Дагестан' => '0500000000000',
                'Буйнакск' => '0500001000000',
                'Дербент' => '0500000600000',
                'Каспийск' => '0500000400000',
                'Махачкала' => '0500000100000',
                'Хасавюрт' => '0500000900000',
                'Прочие города и населенные пункты' => '0500000800000'
            ),
            'Республика Ингушетия' => array(
                'Республика Ингушетия' => '0600000000000',
                'Малгобек' => '0600000400000',
                'Назрань' => '0600000300000',
                'Прочие города и населенные пункты' => '0600000200000'
            ),
            'Республика Калмыкия' => array(
                'Республика Калмыкия' => '0800000000000',
                'Элиста' => '0800000100000',
                'Прочие города и населенные пункты' => '0800200100000'
            ),
            'Республика Карелия' => array(
                'Республика Карелия' => '1000000000000',
                'Петрозаводск' => '1000000100000',
                'Прочие города и населенные пункты' => '1000000400000'
            ),
            'Республика Коми' => array(
                'Республика Коми' => '1100000000000',
                'Сыктывкар' => '1100000100000',
                'Ухта' => '1100000800000',
                'Прочие города и населенные пункты' => '1100000200000'
            ),
            'Республика Марий Эл' => array(
                'Республика Марий Эл' => '1200000000000',
                'Волжск' => '1200000200000',
                'Йошкар-Ола' => '1200000100000',
                'Прочие города и населенные пункты' => '1200000300000'
            ),
            'Республика Мордовия' => array(
                'Республика Мордовия' => '1300000000000',
                'Саранск' => '1300000100000',
                'Рузаевка' => '1300000300000',
                'Прочие города и населенные пункты' => '1300000200000'
            ),
            'Республика Саха (Якутия)' => array(
                'Республика Саха (Якутия)' => '1400000000000',
                'Нерюнгри' => '1400000200000',
                'Якутск' => '1400000100000',
                'Прочие города и населенные пункты' => '1400200000200'
            ),
            'Республика Северная Осетия - Алания' => array(
                'Республика Северная Осетия - Алания' => '1500000000000',
                'Владикавказ' => '1500000100000',
                'Прочие города и населенные пункты' => '1500200100000'
            ),
            'Республика Татарстан' => array(
                'Республика Татарстан' => '1600000000000',
                'Набережные Челны' => '1600000200000',
                'Елабуга' => '1601900100000',
                'Бугульма' => '1601400100000',
                'Лениногорск' => '1602600100000',
                'Чистополь' => '1604300100000',
                'Альметьевск' => '1600800100000',
                'Зеленодольск' => '1602100100000',
                'Нижнекамск' => '1603100100000',
                'Казань' => '1600000100000',
                'Прочие города и населенные пункты' => '1600200100000'
            ),
            'Республика Тыва' => array(
                'Республика Тыва' => '1700000000000',
                'Кызыл' => '1700000100000',
                'Прочие города и населенные пункты' => '1700000200000'
            ),
            'Республика Хакасия' => array(
                'Республика Хакасия' => '1900000000000',
                'Абакан' => '1900000100000',
                'Саяногорск' => '1900000200000',
                'Черногорск' => '1900000300000',
                'Прочие города и населенные пункты' => '1900000400000'
            ),
            'Ростовская область' => array(
                'Ростовская область' => '6100000000000',
                'Азов' => '6100001300000',
                'Шахты' => '6100001200000',
                'Волгодонск' => '6100000400000',
                'Гуково' => '6100000500000',
                'Каменск-Шахтинский' => '6100000800000',
                'Новочеркасск' => '6100000900000',
                'Новошахтинск' => '6100001000000',
                'Сальск' => '6103500100000',
                'Таганрог' => '6100001100000',
                'Ростов-на-Дону' => '6100000100000',
                'Батайск' => '6100000300000',
                'Прочие города и населенные пункты' => '6100000700000'
            ),
            'Рязанская область' => array(
                'Рязанская область' => '6200000000000',
                'Рязань' => '6200000100000',
                'Прочие города и населенные пункты' => '6200000400000'
            ),
            'Самарская область' => array(
                'Самарская область' => '6300000000000',
                'Чапаевск' => '6300000600000',
                'Новокуйбышевск' => '6300000300000',
                'Сызрань' => '6300000300000',
                'Самара' => '6300000100000',
                'Тольятти' => '6300000700000',
                'Прочие города и населенные пункты' => '6300000200000'
            ),
            'Саратовская область' => array(
                'Саратовская область' => '6400000000000',
                'Энгельс' => '6400001300000',
                'Балаково' => '6400000400000',
                'Балашов' => '6400000500000',
                'Вольск' => '6400000600000',
                'Саратов' => '6400000100000',
                'Прочие города и населенные пункты' => '6400000300000'
            ),
            'Сахалинская область' => array(
                'Сахалинская область' => '6500000000000',
                'Южно-Сахалинск' => '6500000100000',
                'Прочие города и населенные пункты' => '6501800100000'
            ),
            'Свердловская область' => array(
                'Свердловская область' => '6600000000000',
                'Верхняя Салда' => '6600004500000',
                'Полевской' => '6600001700000',
                'Асбест' => '6600000200000',
                'Ревда' => '6600001800000',
                'Екатеринбург' => '6600000100000',
                'Березовский' => '6600000300000',
                'Верхняя Пышма' => '6600000400000',
                'Новоуральск' => '6600001500000',
                'Первоуральск' => '6600001600000',
                'Прочие города и населенные пункты' => '6600002400000'
            ),
            'Смоленская область' => array(
                'Смоленская область' => '6700000000000',
                'Смоленск' => '6700000300000',
                'Вязьма' => '6700300100000',
                'Рославль' => '6701600100000',
                'Сафоново' => '6701800100000',
                'Ярцево' => '6702500100000',
                'Прочие города и населенные пункты' => '6700000200000'
            ),
            'Ставропольский край' => array(
                'Ставропольский край' => '2600000000000',
                'Кисловодск' => '2600000400000',
                'Михайловск' => '2602700100000',
                'Ставрополь' => '2600000100000',
                'Буденновск' => '2600700100000',
                'Георгиевск' => '2600000900000',
                'Ессентуки' => '2600000200000',
                'Минеральные воды' => '2601700200000',
                'Невинномысск' => '2600000600000',
                'Пятигорск' => '2600000700000',
                'Прочие города и населенные пункты' => '2600000500000'
            ),
            'Тамбовская область' => array(
                'Тамбовская область' => '6800000000000',
                'Тамбов' => '6800000400000',
                'Мичуринск' => '6800000600000',
                'Прочие города и населенные пункты' => '6800000500000'
            ),
            'Тверская область' => array(
                'Тверская область' => '6900000000000',
                'Вышний Волочек' => '6900000600000',
                'Кимры' => '6900000500000',
                'Ржев' => '6900000300000',
                'Тверь' => '6900000100000',
                'Прочие города и населенные пункты' => '6900000200000'
            ),
            'Томская область' => array(
                'Томская область' => '7000000000000',
                'Северск' => '7000000300000',
                'Томск' => '7000000100000',
                'Прочие города и населенные пункты' => '7000000200000'
            ),
            'Тульская область' => array(
                'Тульская область' => '7100000000000',
                'Узловая' => '7102200100000',
                'Щекино' => '7102400100000',
                'Алексин' => '7100200100000',
                'Ефремов' => '7101000100000',
                'Новомосковск' => '7101700100000',
                'Тула' => '7100000100000',
                'Прочие города и населенные пункты' => '7100000200000'
            ),
            'Тюменская область' => array(
                'Тюменская область' => '7200000000000',
                'Тобольск' => '7200000200000',
                'Тюмень' => '7200000100000',
                'Прочие города и населенные пункты' => '7200200000100',
            ),
            'Удмуртская Республика' => array(
                'Удмуртская Республика' => '1800000000000',
                'Воткинск' => '1800000300000',
                'Глазов' => '1800000400000',
                'Сарапул' => '1800000200000',
                'Ижевск' => '1800000100000',
                'Прочие города и населенные пункты' => '1800000500000'
            ),
            'Ульяновская область' => array(
                'Ульяновская область' => '7300000000000',
                'Димитровград' => '7300000200000',
                'Ульяновск' => '7300000100000',
                'Прочие города и населенные пункты' => '7300000300000'
            ),
            'Хабаровский край' => array(
                'Хабаровский край' => '2700000000000',
                'Хабаровск' => '2700000100000',
                'Амурск' => '2700000300000',
                'Комсомольск-на-Амуре' => '2700000500000',
                'Прочие города и населенные пункты' => '2700000400000'
            ),
            'Ханты-Мансийский автономный округ' => array(
                'Ханты-Мансийский автономный округ' => '8600000000000',
                'Когалым' => '8600000200000',
                'Нижневартовск' => '8600001100000',
                'Нягань' => '8600000500000',
                'Нефтеюганск' => '8600001400000',
                'Ханты-Мансийск' => '8600000100000',
                'Сургут' => '8600001000000',
                'Прочие города и населенные пункты' => '8600001300000'
            ),
            'Челябинская область' => array(
                'Челябинская область' => '7400000000000',
                'Магнитогорск' => '7400000900000',
                'Сатка' => '7401700200000',
                'Чебаркуль' => '7400003500000',
                'Златоуст' => '7400000400000',
                'Миасс' => '7400001000000',
                'Копейск' => '7400000600000',
                'Челябинск' => '7400000100000',
                'Прочие города и населенные пункты' => '7400000200000'
            ),
            'Чеченская Республика' => array(
                'Чеченская Республика' => '2000000000000',
                'Грозный' => '2000000100000'
            ),
            'Чувашская Республика' => array(
                'Чувашская Республика' => '2100000000000',
                'Новочебоксарск' => '2100002400000',
                'Канаш' => '2100002300000',
                'Чебоксары' => '2100000100000',
                'Прочие города и населенные пункты' => '2100002200000'
            ),
            'Чукотский автономный округ' => array(
                'Чукотский автономный округ' => '8700000000000',
                'Анадырь' => '8700000100000'
            ),
            'Ямало-Ненецкий автономный округ' => array(
                'Ямало-Ненецкий автономный округ' => '8900000000000',
                'Ноябрьск' => '8900000700000',
                'Новый Уренгой' => '8900000600000',
                'Прочие города и населенные пункты' => '8900000500000'
            ),
            'Ярославская область' => array(
                'Ярославская область' => '7600000000000',
                'Ярославль' => '7600000100000',
                'Прочие города и населенные пункты' => '7600000200000'
            )
        );
        return $osagoRegion;
    }

    public static function checkCityOnRegion($city)
    {

        $osagoRegion = self::arrayOsago();

        if(isset($osagoRegion[$city])){
            return true;
        }

    }

    public static function validateRegion($data,$region,&$regionO)
    {
        if (!empty($data[$region])){
            $regionO = $data[$region];
        }else{
            $data[$region] = $regionO;
        }
        return $data;
    }

    public static function currectTerritory($region, $city,$file)
    {
        $osagoRegion = self::arrayOsago();
        if (!isset($osagoRegion[$region][$city])){
            if ($city != 'прочие города и населенные пункты'){
                file_put_contents('logs/currectTerritory.txt', var_export([$file,"Регион:" .$region. " Город:" ."$city"], 1)."\n", FILE_APPEND);
            }
        }
    }

    public static function baseBankArray($titles)
    {
        $baseArray = [
            'Мотоциклы и мотороллеры' => [
                'min' => 694,
                'max' => 1407,
            ],
            'Легковые а/м, юрики' => [
                'min' => 2058,
                'max' => 2911,
            ],
            'Легковые а/м, физики' => [
                'min' => 2746,
                'max' => 4942,
            ],
            'Легковые а/м, используемые в такси' => [
                'min' => 4110,
                'max' => 7399,
            ],
            'Грузовые а/м с разрешенной массой до 16 т вкл.' => [
                'min' => 2807,
                'max' => 5053,
            ],
            'Грузовые а/м с разрешенной массой свыше 16 т' => [
                'min' => 4227,
                'max' => 7609,
            ],
            'Автобусы с числом мест сидения до 20 вкл.' => [
                'min' => 2246,
                'max' => 4044,
            ],
            'Автобусы с числом мест сидения свыше 20' => [
                'min' => 2807,
                'max' => 5053,
            ],
            'Автобусы, используемые в такси' => [
                'min' => 4110,
                'max' => 7399,
            ],
            'Троллейбусы' => [
                'min' => 2246,
                'max' => 4044,
            ],
            'Трамваи' => [
                'min' => 1401,
                'max' => 2521,
            ],
            'Тракторы, дорожно-строительные и иные машины' => [
                'min' => 899,
                'max' => 1895,
                ]
        ];
        return $baseArray[$titles];
    }

    public static function quotes($city)
    {
        return "$4 == ".'"'.$city.'"';
    }

  public static function mb_ucfirst($string, $encoding = 'UTF-8') {
        $firstChar = mb_strtoupper(mb_substr($string, 0, 1, $encoding), $encoding);
        return $firstChar . mb_substr($string, 1, mb_strlen($string, $encoding), $encoding);
    }

    public static function city($title)
    {
        return $title;
    }

    public static function  changeAnotherCity($city)
    {
        $searchArray = [
            'Иностранное государство' => [
                'иностранных',
                'государствах',
                'в иностранных государствах'
            ],
            'Следует к месту регистрации ТС' => [
                'регистрации',
                'осмотра',
                'следующие',
                'следующих',

                'технического',
                'cледования'
            ]
        ];
        foreach ($searchArray as $title => $searches){
            foreach ($searches as $search){
                if (mb_strpos(mb_strtolower($city), $search) !== false){
                    return $title;
                }
            }
        }
    }


}